In [63]:
import pandas as pd

In [64]:
h = ('AA','2012-02-01',100,10.2)
s = pd.Series(h)
type(s)

pandas.core.series.Series

In [68]:
print(s[2])

100

In [66]:
d = {'name' : 'IBM', 'date' : '2010-09-08', 'shares' : 100, 'price' : 10.2}
ds = pd.Series(d)
ds

name             IBM
date      2010-09-08
shares           100
price           10.2
dtype: object

In [67]:
ds['shares']

100

In [10]:
f = ['FB', '2001-08-02', 90, 3.2]
f = pd.Series(f, index=['name', 'date', 'shares', 'price'])
print(f)

name              FB
date      2001-08-02
shares            90
price            3.2
dtype: object

In [11]:
f['name']

'FB'

In [12]:
f[['name','date']]

name            FB
date    2001-08-02
dtype: object

## DataFrame

In [45]:
data = { 'name' : ['AA', 'IBM', 'GOOG'],
       'date' : ['2001-12-01', '2012-02-10', '2010-04-09'],
       'shares' : [100, 30, 90],
       'price' : [12.3, 10.3, 32.2]
}
df = pd.DataFrame(data)
df

   name        date  shares  price
0    AA  2001-12-01     100   12.3
1   IBM  2012-02-10      30   10.3
2  GOOG  2010-04-09      90   32.2

In [46]:
df['owner'] = 'unknown'
df

   name        date  shares  price    owner
0    AA  2001-12-01     100   12.3  unknown
1   IBM  2012-02-10      30   10.3  unknown
2  GOOG  2010-04-09      90   32.2  unknown

In [47]:
df.index = ['one','two','three']

In [48]:
df.set_index(['name'])

            date  shares  price    owner
name
AA    2001-12-01     100   12.3  unknown
IBM   2012-02-10      30   10.3  unknown
GOOG  2010-04-09      90   32.2  unknown

In [49]:
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  unknown
two     IBM  2012-02-10      30   10.3  unknown
three  GOOG  2010-04-09      90   32.2  unknown

In [23]:
# access data using column-index
df['shares']

one      100
two       30
three     90
Name: shares, dtype: int64

In [38]:
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  unknown
two     IBM  2012-02-10      30   10.3  unknown
three  GOOG  2010-04-09      90   32.2  unknown

In [50]:
# access data by row-index
df.loc['one',:]

name              AA
date      2001-12-01
shares           100
price           12.3
owner        unknown
Name: one, dtype: object

In [53]:
df.loc['one','shares']

100

In [32]:
# access all rows for a column
df.loc[:, 'name']

one        AA
two       IBM
three    GOOG
Name: name, dtype: object

In [54]:
# access specific element from the DataFrame,
df.iloc[0, 3]

12.3

In [55]:
df

       name        date  shares  price    owner
one      AA  2001-12-01     100   12.3  unknown
two     IBM  2012-02-10      30   10.3  unknown
three  GOOG  2010-04-09      90   32.2  unknown

In [58]:
del df['owner']

In [59]:
df

       name        date  shares  price
one      AA  2001-12-01     100   12.3
two     IBM  2012-02-10      30   10.3
three  GOOG  2010-04-09      90   32.2

In [60]:
df.drop('shares',axis=1)

       name        date  price
one      AA  2001-12-01   12.3
two     IBM  2012-02-10   10.3
three  GOOG  2010-04-09   32.2

In [61]:
df

       name        date  shares  price
one      AA  2001-12-01     100   12.3
two     IBM  2012-02-10      30   10.3
three  GOOG  2010-04-09      90   32.2